// Написать и проверить функции
// 1. Принимает 2 аргумента, 3й аргумент не обязателен - если он есть, то функция возвращает сумму первых двух аргументов,
// иначе - разницу.

// 2. Определить сколько раз каждый элемент встречается в массиве. Оформить ввиде функции, принимающей любой массив
const fruits = ['kiwi', 'apple', 'kiwi', 'orange', 'kiwi', 'apple'];

// 3. Получить единый массив из любимых пицц каждого друга - т.е. массив только из пицц
const friends = [
    { name: 'alex', pizzas: ['cheese', 'pepperoni'] },
    { name: 'mike', pizzas: ['salami', 'margarita'] },
    { name: 'stas', pizzas: ['meat'] },
    { name: 'anna', pizzas: ['fish'] }
];

// 4. Записать строку (символы строки) в обратном порядке
const myStr = 'pizza';

// 5. функция принимает число n, вернуть количество положительных нечетных чисел меньше n

// 6. Функция принимает 2 аргумента - 2 других функции, также есть счетчик количества вызовов функции, каждый
// четный вызов - вернуть результат работы первой функции(1 аргумент), нечетный - второй.